#include<iostream>
using namespace std;



//ДЗ№1
//int main(){
//setlocale(0, "RUS");

//cout << "Введите номер дня недели:\n";
//cout << "1:Понедельник\n2:Вторник\n3:Среда\n4:Четверг\n5:Пятница\n6:Суббота\n7:Воскресенье\n\n";
//int Day_Week;
//cin >> Day_Week;

//ВАРИАНТ 1
//switch (Day_Week) 
//{
//case 1:
//cout << "Понедельник";
//break;

//case 2:
//cout << "Вторник";
//break;

//case 3:
//cout << "Среда";
//break;

//case 4:
//cout << "Четверг";
//break;
  
//case 5:
//cout << "Пятница";
//break;

  
//case 6:
//cout << "Суббота";
//break;

//case 7:
//cout << "Воскресенье";
//break;

//default:
//  cout << "ОШИБКА";
//}



//ВАРИАНТ 2
//if (Day_Week == 1) 
//{
//cout << "Понедельник"; 
//}

//else if (Day_Week == 2) 
//{
//cout << "Вторник"; 
//}

//else if  (Day_Week == 3) 
//{
//cout << "Среда"; 
//}

//else if (Day_Week == 4) 
//{
//cout << "Четверг"; 
//}

//else if (Day_Week == 5) 
//{
//cout << "Пятница"; 
//}

//else if (Day_Week == 6) 
//{
//cout << "Суббота"; 
//}

//else if (Day_Week == 7) 
//{
//cout << "Воскресенье"; 
//}

//else 
//{
//cout << "ОШИБКА"; 
//}
//}








//ДЗ№2
//int main(){
//setlocale(0, "RUS");


//cout << "Вопрос №1\nСколько будет 1437 + 1673?\n";
//cout << "Варианты ответа:\n1:3100\n2:3000\n3:3110\n4:2900\n\n";
//int answer;
//cin >> answer;

// IF №1
//if (answer == 3) 
//{
//cout << "Правильный ответ!\n\n";
//cout << "Вопрос №2\nСколько планет в Солнечной системе?(Не учитывая Плутон)\n";
//cout << "Варианты ответа:\n1:7\n2:8\n3:9\n4:12\n\n";
//cin >> answer;

// IF №2
//if (answer == 2) 
//{
//cout << "Правильный ответ!\n\n";
//cout << "Вопрос №3\nКакая масса у Земли(в кг)?\n";
//cout << "Варианты ответа:\n1:5,972E24\n2:5,972E25\n3:5,982E24\n4:5,973E24\n\n";
//cin >> answer;

// IF №3
//if (answer == 1) 
//{
//cout << "Правильный ответ!\n\n";
//cout << "Вопрос №4\nСтолица Украины?\n";
//cout << "Варианты ответа:\n1:Харьков\n2:Киев\n3:Львов\n4:Одесса\n\n";
//cin >> answer;

// IF №4
//if (answer == 2) 
//{
//cout << "Правильный ответ!\n\n";
//cout << "Вопрос №5\nСколько дней в году?\n";
//cout << "Варианты ответа:\n1:375\n2:355\n3:345\n4:365\n\n";
//cin >> answer;

// IF №5
//if (answer == 4) 
//{
//cout << "Правильный ответ!\n";
//cout << "Вы ответили на все вопросы правильно.\n\nПОБЕДА!";
//}


//Пятый if
//else 
//{
//cout << "Неправильный ответ! Игра окончена!";  
//}
//}

//Четвёртый if
//else 
//{
//cout << "Неправильный ответ! Игра окончена!";  
//}
//}

//Третий if
//else 
//{
//cout << "Неправильный ответ! Игра окончена!"; 
//}
//}

//Второй if
//else 
//{
//cout << "Неправильный ответ! Игра окончена!";
//}
//}

//Первый if
//else 
//{
//cout << "Неправильный ответ! Игра окончена!";
//}
//}




  
  
  





  















    
